# Практика: Числа
# Создайте файл simple.py, и сделайте в нем следующую задачу:
a = 2
b = 0.5
print (a + b)

# Практика: Строки
name = input('ВСТАВЬТЕ ВАШЕ ИМЯ: ')
print(f'Привет, {name}!')

# Практика: Числа
v = int(input('Введите число от 1 до 10: '))
d = 10
print(f'{v + d}')

# Практика: Строки
name = input('Введите ваше имя: ').upper()
print(f'Привет, {name}! Как дела?')

# Практика: Приведение типов
a = 1.0
print (type(a))
b = 2.5
print (type(b))
c=1
print (bool(c))
d = ' '
print (bool(d))
x = 0
print (bool(x))

name = input ('Введите ваше имя: ')
print(f'Привет, {name}')

year = input('Введите год рождения ')
print(type(year))
real_age = 2023 - int(year)
print(f'Ваш возраст: {real_age}')
